cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# System Tools
brew 'atuin'
brew 'bat'           # Better cat with syntax highlighting
brew 'bottom'        # Modern htop alternative
brew 'ctop'          # Top for containers
brew 'dive'          # Docker image analyzer
brew 'duf'           # Better df (disk usage)
brew 'dust'          # Better du (directory usage)
brew 'eza'
brew 'fd'            # Fast find alternative
brew 'git'
brew 'helix'
brew 'htop'
brew 'hyperfine'     # Command benchmarking
brew 'mas'           # Mac App Store CLI
brew 'mise'
brew 'procs'         # Modern ps replacement
brew 'ripgrep'       # Ultra-fast grep
brew 'starship'
brew 'tldr'          # Simplified man pages
brew 'trash'         # Safe rm replacement
brew 'tree'          # Directory visualization
brew 'wget'
brew 'yt-dlp'

# Development
brew 'fzf'
brew 'gh'            # GitHub CLI
brew 'git-delta'     # Better git diff
brew 'jq'
brew 'just'          # Command runner (Makefile alternative)
brew 'lazygit'       # Terminal UI for Git
brew 'node'          # JavaScript runtime
brew 'postgresql@14'
brew 'python@3.13'   # Latest Python
brew 'spaceman-diff'
brew 'uv'            # Fast Python package manager
brew 'yq'            # YAML processor
cask 'cursor'        # AI-powered code editor
cask 'docker'
cask 'livebook'
cask 'postman'
cask 'popsql'
cask 'visual-studio-code'

# System Applications
cask 'android-platform-tools'
cask 'bitwarden'
cask 'ghostty'
cask 'iterm2'

# Utilities
cask 'cleanmymac'
cask 'raycast'
cask 'rectangle'

# Media & Entertainment
brew 'ffmpeg'
cask 'qbittorrent'
cask 'spotify'
cask 'syncplay'
cask 'vlc'

# Communication
cask 'discord'
cask 'messenger'
cask 'notion'
cask 'notion-calendar'
cask 'slack'
cask 'whatsapp'
cask 'zoom'

# Browsers
cask 'zen-browser@twilight'

# Fonts
cask 'font-blex-mono-nerd-font'

# Advanced Development Tools
brew 'bandwhich'     # Network utilization by process
brew 'broot'         # Interactive directory tree navigator
brew 'choose'        # Human-friendly alternative to cut/awk
brew 'delta'         # Syntax-highlighting pager for git/diff
brew 'glow'          # Terminal markdown renderer
brew 'hexyl'         # Command-line hex viewer
brew 'jless'         # JSON viewer and explorer
brew 'lnav'          # Log file navigator
brew 'oha'           # HTTP load testing (wrk alternative)
brew 'tokei'         # Code statistics tool
brew 'watchexec'     # Execute commands when files change
brew 'xh'            # Friendly HTTP client (HTTPie in Rust)
brew 'zellij'        # Terminal workspace (tmux alternative)

# Modern Replacements for Classic Tools
brew 'sd'            # Intuitive find & replace (sed alternative)
brew 'grc'           # Colorize command output
brew 'httpie'        # Better curl for APIs
brew 'entr'          # File watcher for automation
brew 'zoxide'        # Smarter cd command
brew 'tealdeer'      # Very fast tldr client
brew 'zoxide'        # Smarter cd command

# AI Tools
cask 'claude'
cask 'claude-code'
cask 'chatgpt'

# Productivity & Development Apps
cask 'dash'                   # API documentation browser
cask 'hypercal'               # Menu bar calendar
cask 'klokki-slim'            # Time tracking
cask 'mindnode'               # Mind mapping
cask 'pastebot'               # Clipboard manager
cask 'proxyman'               # Web debugging proxy
cask 'sequel-ace'             # MySQL client
cask 'tableflip'              # Markdown table editor

# Work
cask 'figma'
