cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'atuin'
# System
cask 'android-platform-tools'
cask 'bitwarden'
cask 'iterm2'
brew 'eza'
# brew 'ffmpeg'
cask 'ghostty'
brew 'ffmpeg'
brew 'git'
brew 'helix'
brew 'htop'

# Utilities
brew 'wget'
cask 'raycast'
cask 'rectangle'
cask 'cleanmymac'
brew 'yt-dlp'

# Development
brew 'git'
brew 'helix'
brew 'jq'
brew 'fzf'
cask 'docker'
cask 'livebook'
brew 'mise'
cask 'postman'
brew 'spaceman-diff'
brew 'starship'
cask 'visual-studio-code'
cask 'popsql'

# Media
cask 'spotify'
cask 'syncplay'
cask 'vlc'
cask 'qbittorrent'

# Communication
cask 'discord'
<<<<<<< HEAD
cask 'font-blex-mono-nerd-font'
cask 'ghostty'
brew 'postgresql@14'
=======
>>>>>>> ba1f4ad (merged)
cask 'messenger'
cask 'notion'
cask 'notion-calendar'
cask 'slack'
cask 'spotify'
cask 'syncplay'
brew 'mise'
brew 'spotify'
brew 'helix'
brew 'starship'
brew 'git'

brew 'spaceman-diff'
brew 'wget'
brew 'yt-dlp'

cask 'android-platform-tools'
cask 'notion-calendar'
cask 'raycast'
cask 'whatsapp'
cask 'windsurf'
cask 'zoom'
# Browsers
cask 'zen-browser@twilight'

# Fonts
cask 'font-blex-mono-nerd-font'
