# Homebrew Bundle - Cross-platform packages
# macOS casks are in Brewfile.mac
#
# Usage:
#   brew bundle                      # Install from Brewfile
#   brew bundle --file=Brewfile.mac  # Install macOS casks (macOS only)
#   brew bundle cleanup              # Remove unlisted packages

tap 'homebrew/bundle'

# Core System Tools
brew 'git'
brew 'stow'
brew 'mise'           # Manages language runtimes (node, python, rust, go, etc.)
brew 'wget'
brew 'tree'
brew 'trash'          # Safe rm replacement

# Modern CLI Replacements
brew 'bat'            # Better cat with syntax highlighting
brew 'eza'            # Modern ls replacement
brew 'fd'             # Fast find alternative
brew 'ripgrep'        # Ultra-fast grep
brew 'delta'          # Syntax-highlighting pager for git/diff
brew 'zoxide'         # Smarter cd command
brew 'dust'           # Better du (directory usage)
brew 'duf'            # Better df (disk usage)
brew 'bottom'         # Modern htop alternative
brew 'procs'          # Modern ps replacement
brew 'sd'             # Intuitive find & replace (sed alternative)
brew 'xh'             # Friendly HTTP client (HTTPie in Rust)
brew 'tealdeer'       # Very fast tldr client

# Development Tools
brew 'fzf'            # Fuzzy finder
brew 'jq'             # JSON processor
brew 'yq'             # YAML processor
brew 'just'           # Command runner (Makefile alternative)
brew 'gh'             # GitHub CLI
brew 'lazygit'        # Terminal UI for Git
brew 'starship'       # Shell prompt
brew 'helix'          # Text editor
brew 'hyperfine'      # Command benchmarking

# Containers & DevOps
brew 'ctop'           # Top for containers
brew 'dive'           # Docker image analyzer

# Database
brew 'postgresql@14'

# Specialized Tools
brew 'ffmpeg'
brew 'yt-dlp'
brew 'hut'            # Source Hut CLI
brew 'spaceman-diff'
brew 'bandwhich'      # Network utilization by process
brew 'broot'          # Interactive directory tree navigator
brew 'choose'         # Human-friendly alternative to cut/awk
brew 'glow'           # Terminal markdown renderer
brew 'hexyl'          # Command-line hex viewer
brew 'jless'          # JSON viewer and explorer
brew 'lnav'           # Log file navigator
brew 'oha'            # HTTP load testing (wrk alternative)
brew 'tokei'          # Code statistics tool
brew 'watchexec'      # Execute commands when files change
brew 'zellij'         # Terminal workspace (tmux alternative)
brew 'grc'            # Colorize command output
brew 'entr'           # File watcher for automation
brew 'htop'
